skortela/esp8266_p1meter_sv/src/main.cpp
bool isNumber(char *res, int len)
{
    for (int i = 0; i < len; i++)
    {
        if (((res[i] < '0') || (res[i] > '9')) && (res[i] != '.' && res[i] != 0))
            return false;
    }
    return true;
}

int FindCharInArrayRev(char array[], char c, int len)
{
    for (int i = len - 1; i >= 0; i--)
    {
        if (array[i] == c)
            return i;
    }
    return -1;
}

double getValue(char *buffer, int maxlen, char startchar, char endchar)
{
    int s = FindCharInArrayRev(buffer, startchar, maxlen - 2);
    int l = FindCharInArrayRev(buffer, endchar, maxlen - 2) - s - 1;

    char res[16];
    memset(res, 0, sizeof(res));

    if (strncpy(res, buffer + s + 1, l))
    {
        if (endchar == '*')
        {
            if (isNumber(res, l))
                return (atof(res));
        }
        else if (endchar == ')')
        {
            if (isNumber(res, l))
                return atof(res);
        }
    }
    
    return 0;
}

void addJson(const char* field, double value) {
#ifdef SEND_AS_JSON
    // Add comma if jsonPos > 2
    if (jsonPos > 2) {
        telegramJson[jsonPos++] = ','; // Add comma and update jsonPos
    }

    // Add {"field": "value"} to telegramJson buffer
    int bytesWritten = snprintf(telegramJson + jsonPos, P1_MAXJSONLENGTH - jsonPos, "\"%s\": %.3f", field, value);

    // Update jsonPos with the number of bytes written
    if (bytesWritten >= 0 && bytesWritten < P1_MAXJSONLENGTH - jsonPos) {
        jsonPos += bytesWritten;
    }
#endif
}
// parsing of telegram according to Swedish ESMR 5.0 implementation //UKR 1220
bool decode_telegram(int len)
{
    int startChar = FindCharInArrayRev(telegram, '/', len);
    int endChar = FindCharInArrayRev(telegram, '!', len);
    bool validCRCFound = false;

    for (int cnt = 0; cnt < len; cnt++) {
        Serial.print(telegram[cnt]);
    }
    Serial.print("\n");

    if (startChar >= 0)
    {
        // * Start found. Reset CRC calculation
        currentCRC = CRC16(0x0000,(unsigned char *) telegram+startChar, len-startChar);
#ifdef SEND_AS_JSON
        strcpy(telegramJson, "{");
        jsonPos = strlen(telegramJson);
#endif
    }
    else if (endChar >= 0)
    {
        // * Add to crc calc
        currentCRC = CRC16(currentCRC,(unsigned char*)telegram+endChar, 1);

        char messageCRC[5];
        strncpy(messageCRC, telegram + endChar + 1, 4);

        messageCRC[4] = 0;   // * Thanks to HarmOtten (issue 5)
        validCRCFound = (strtol(messageCRC, NULL, 16) == currentCRC);

        if (validCRCFound)
            Serial.println(F("CRC Valid!"));
        else
            Serial.println(F("CRC Invalid!"));

        currentCRC = 0;
#ifdef SEND_AS_JSON
        strcpy(telegramJson + jsonPos, "}");
        jsonPos = strlen(telegramJson);
#endif
    }
    else
    {
        currentCRC = CRC16(currentCRC, (unsigned char*) telegram, len);
    }

    // 1-0:1.8.0(000992.992*kWh)
    // 1-0:1.8.0 = Cumulative hourly active import energy (A+) (Q1+Q4)
    if (strncmp(telegram, "1-0:1.8.0", 9) == 0)
    {
        CONSUMPTION = getValue(telegram, len, '(', '*');
        addJson("consumption", CONSUMPTION);
    }

    // 1-0:2.8.0(000560.157*kWh)
    // 1-0:2.8.0 = Cumulative hourly active export energy (A-) (Q2+Q3)
    if (strncmp(telegram, "1-0:2.8.0", 9) == 0)
    {
        RETURNDELIVERY = getValue(telegram, len, '(', '*');
        addJson("returndelivery", RETURNDELIVERY);
    }

    // 1-0:3.8.0(000560.157*kWh)
    // 1-0:3.8.0 = Cumulative hourly reactive import energy (R+) (Q1+Q2)
    if (strncmp(telegram, "1-0:3.8.0", 9) == 0)
    {
        CONSUMPTION_REACT = getValue(telegram, len, '(', '*');
        addJson("consumption_reactive", CONSUMPTION_REACT);
    }

    // 1-0:4.8.0(000560.157*kWh)
    // 1-0:4.8.0 = Cumulative hourly reactive export energy (R-) (Q3+Q4)
    if (strncmp(telegram, "1-0:4.8.0", 9) == 0)
    {
        RETURNDELIVERY_REACT = getValue(telegram, len, '(', '*');
        addJson("returndelivery_reactive", RETURNDELIVERY_REACT);
    }

    // 1-0:1.7.0(00.424*kW)
    // 1-0:1.7.x = Momentary Active power+ (Q1+Q4)
    if (strncmp(telegram, "1-0:1.7.0", 9) == 0)
    {
        ACTUAL_CONSUMPTION = getValue(telegram, len, '(', '*');
        addJson("actual_consumption", ACTUAL_CONSUMPTION);
    }

    // 1-0:2.7.0(00.000*kW) 
    // 1-0:2.7.x = Momentary Active power- (Q2+Q3)
    if (strncmp(telegram, "1-0:2.7.0", 9) == 0)
    {
        ACTUAL_RETURNDELIVERY = getValue(telegram, len, '(', '*');
        addJson("actual_returndelivery", ACTUAL_RETURNDELIVERY);
    }

    // 1-0:3.7.0(00.424*kW)
    // 1-0:3.7.x = Momentary Reactive power + ( Q1+Q2)
    if (strncmp(telegram, "1-0:3.7.0", 9) == 0)
    {
        ACTUAL_CONSUMPTION_REACT = getValue(telegram, len, '(', '*');
        addJson("actual_consumption_reactive", ACTUAL_CONSUMPTION_REACT);
    }

    // 1-0:4.7.0(00.000*kW) 
    // 1-0:4.7.x = Momentary Reactive power - ( Q3+Q4)
    if (strncmp(telegram, "1-0:4.7.0", 9) == 0)
    {
        ACTUAL_RETURNDELIVERY_REACT = getValue(telegram, len, '(', '*');
        addJson("actual_returndelivery_reactive", ACTUAL_RETURNDELIVERY_REACT);
    }

    // 1-0:21.7.0(00.378*kW)
    // 1-0:21.7.0 = Momentary Active power+ (L1)
    if (strncmp(telegram, "1-0:21.7.0", 10) == 0)
    {
        L1_INSTANT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l1_instant_power_usage", L1_INSTANT_POWER_USAGE);
    }

    // 1-0:22.7.0(00.378*kW)
    // 1-0:22.7.0 = Momentary Active power- (L1)
    if (strncmp(telegram, "1-0:22.7.0", 10) == 0)
    {
        L1_INSTANT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l1_instant_power_delivery", L1_INSTANT_POWER_DELIVERY);
    }

    // 1-0:41.7.0(00.378*kW)
    // 1-0:41.7.0 = Momentary Active power+ (L2)
    if (strncmp(telegram, "1-0:41.7.0", 10) == 0)
    {
        L2_INSTANT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l2_instant_power_usage", L2_INSTANT_POWER_USAGE);
    }

    // 1-0:42.7.0(00.378*kW)
    // 1-0:42.7.0 = Momentary Active power- (L2)
    if (strncmp(telegram, "1-0:42.7.0", 10) == 0)
    {
        L2_INSTANT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l2_instant_power_delivery", L2_INSTANT_POWER_DELIVERY);
    }

    // 1-0:61.7.0(00.378*kW)
    // 1-0:61.7.0 = Momentary Active power+ (L3)
    if (strncmp(telegram, "1-0:61.7.0", 10) == 0)
    {
        L3_INSTANT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l3_instant_power_usage", L3_INSTANT_POWER_USAGE);
    }

    // 1-0:62.7.0(00.378*kW)
    // 1-0:62.7.0 = Momentary Active power- (L3)
    if (strncmp(telegram, "1-0:62.7.0", 10) == 0)
    {
        L3_INSTANT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l3_instant_power_delivery", L3_INSTANT_POWER_DELIVERY);
    }

    // 1-0:23.7.0(00.378*kW)
    // 1-0:23.7.0 = Momentary Reactive power+ (L1)
    if (strncmp(telegram, "1-0:23.7.0", 10) == 0)
    {
        L1_REACT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l1_reactive_power_usage", L1_REACT_POWER_USAGE);
    }

    // 1-0:24.7.0(00.378*kW)
    // 1-0:24.7.0 = Momentary Reactive power- (L1)
    if (strncmp(telegram, "1-0:24.7.0", 10) == 0)
    {
        L1_REACT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l1_reactive_power_delivery", L1_REACT_POWER_DELIVERY);
    }

    // 1-0:43.7.0(00.378*kW)
    // 1-0:43.7.0 = Momentary Reactive power+ (L2)
    if (strncmp(telegram, "1-0:43.7.0", 10) == 0)
    {
        L2_REACT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l2_reactive_power_usage", L2_REACT_POWER_USAGE);
    }

    // 1-0:44.7.0(00.378*kW)
    // 1-0:44.7.0 = Momentary Reactive power+ (L2)
    if (strncmp(telegram, "1-0:44.7.0", 10) == 0)
    {
        L2_REACT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l2_reactive_power_delivery", L2_REACT_POWER_DELIVERY);
    }

