skortela/esp8266_p1meter_sv/src/main.cpp
    // 1-0:63.7.0(00.378*kW)
    // 1-0:63.7.0 = Momentary Reactive power+ (L3)
    if (strncmp(telegram, "1-0:63.7.0", 10) == 0)
    {
        L3_REACT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l3_reactive_power_usage", L3_REACT_POWER_USAGE);
    }

    // 1-0:64.7.0(00.378*kW)
    // 1-0:64.7.0 = Momentary Reactive power- (L3)
    if (strncmp(telegram, "1-0:64.7.0", 10) == 0)
    {
        L3_REACT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l3_reactive_power_delivery", L3_REACT_POWER_DELIVERY);
    }

    // 1-0:31.7.0(002*A)
    // 1-0:31.7.0 = Momentary RMS Current phase L1
    if (strncmp(telegram, "1-0:31.7.0", 10) == 0)
    {
        L1_INSTANT_POWER_CURRENT = getValue(telegram, len, '(', '*');
        addJson("l1_instant_power_current", L1_INSTANT_POWER_CURRENT);
    }
    // 1-0:51.7.0(002*A)
    // 1-0:51.7.0 = Momentary RMS Current phase L2
    if (strncmp(telegram, "1-0:51.7.0", 10) == 0)
    {
        L2_INSTANT_POWER_CURRENT = getValue(telegram, len, '(', '*');
        addJson("l2_instant_power_current", L2_INSTANT_POWER_CURRENT);
    }
    
    // 1-0:71.7.0(002*A)
    // 1-0:71.7.0 = Momentary RMS Current phase L3
    if (strncmp(telegram, "1-0:71.7.0", 10) == 0)
    {
        L3_INSTANT_POWER_CURRENT = getValue(telegram, len, '(', '*');
        addJson("l3_instant_power_current", L3_INSTANT_POWER_CURRENT);
    }

    // 1-0:32.7.0(232.0*V)
    // 1-0:32.7.0 = Momentary RMS Phase voltage L1
    if (strncmp(telegram, "1-0:32.7.0", 10) == 0)
    {
        L1_VOLTAGE = getValue(telegram, len, '(', '*');
        addJson("l1_voltage", L1_VOLTAGE);
    }
    // 1-0:52.7.0(232.0*V)
    // 1-0:52.7.0 = Momentary RMS Phase voltage L2
    if (strncmp(telegram, "1-0:52.7.0", 10) == 0)
    {
        L2_VOLTAGE = getValue(telegram, len, '(', '*');
        addJson("l2_voltage", L2_VOLTAGE);
    }   
    // 1-0:72.7.0(232.0*V)
    // 1-0:72.7.0 = Momentary RMS Phase voltage L3
    if (strncmp(telegram, "1-0:72.7.0", 10) == 0)
    {
        L3_VOLTAGE = getValue(telegram, len, '(', '*');
        addJson("l3_voltage", L3_VOLTAGE);
    }

    return validCRCFound;
}

void read_p1_hardwareserial()
{
    if (Serial.available())
    {
        memset(telegram, 0, sizeof(telegram));

        while (Serial.available())
        {
            ESP.wdtDisable();
            int len = Serial.readBytesUntil('\n', telegram, P1_MAXLINELENGTH);
            ESP.wdtEnable(1);

            processLine(len);
        }
    }
}

void processLine(int len) {
    telegram[len] = '\n';
    telegram[len + 1] = 0;
    yield();

    bool result = decode_telegram(len + 1);
    if (result) {
        send_data_to_broker();
        LAST_UPDATE_SENT = millis();
    }
}

// **********************************
// * EEPROM helpers                 *
// **********************************

String read_eeprom(int offset, int len)
{
    Serial.print(F("read_eeprom()"));

    String res = "";
    for (int i = 0; i < len; ++i)
    {
        res += char(EEPROM.read(i + offset));
    }
    return res;
}

void write_eeprom(int offset, int len, String value)
{
    Serial.println(F("write_eeprom()"));
    for (int i = 0; i < len; ++i)
    {
        if ((unsigned)i < value.length())
        {
            EEPROM.write(i + offset, value[i]);
        }
        else
        {
            EEPROM.write(i + offset, 0);
        }
    }
}

// ******************************************
// * Callback for saving WIFI config        *
// ******************************************

bool shouldSaveConfig = false;

// * Callback notifying us of the need to save config
void save_wifi_config_callback ()
{
    Serial.println(F("Should save config"));
    shouldSaveConfig = true;
}

// **********************************
// * Setup OTA                      *
// **********************************

void setup_ota()
{
    Serial.println(F("Arduino OTA activated."));

    // * Port defaults to 8266
    ArduinoOTA.setPort(8266);

    // * Set hostname for OTA
    ArduinoOTA.setHostname(HOSTNAME);
    ArduinoOTA.setPassword(OTA_PASSWORD);

    ArduinoOTA.onStart([]()
    {
        Serial.println(F("Arduino OTA: Start"));
    });

    ArduinoOTA.onEnd([]()
    {
        Serial.println(F("Arduino OTA: End (Running reboot)"));
    });

    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
    {
        Serial.printf("Arduino OTA Progress: %u%%\r", (progress / (total / 100)));
    });

    ArduinoOTA.onError([](ota_error_t error)
    {
        Serial.printf("Arduino OTA Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR)
            Serial.println(F("Arduino OTA: Auth Failed"));
        else if (error == OTA_BEGIN_ERROR)
            Serial.println(F("Arduino OTA: Begin Failed"));
        else if (error == OTA_CONNECT_ERROR)
            Serial.println(F("Arduino OTA: Connect Failed"));
        else if (error == OTA_RECEIVE_ERROR)
            Serial.println(F("Arduino OTA: Receive Failed"));
        else if (error == OTA_END_ERROR)
            Serial.println(F("Arduino OTA: End Failed"));
    });

    ArduinoOTA.begin();
    Serial.println(F("Arduino OTA finished"));
}

// **********************************
// * Setup MDNS discovery service   *
// **********************************

void setup_mdns()
{
    Serial.println(F("Starting MDNS responder service"));

    bool mdns_result = MDNS.begin(HOSTNAME);
    if (mdns_result)
    {
        MDNS.addService("http", "tcp", 80);
    }
}

// **********************************
// * Setup Main                     *
// **********************************

void setup()
{
    // * Configure EEPROM
    EEPROM.begin(512);

    // Setup a hw serial connection for communication with the P1 meter and logging (not using inversion)
    Serial.begin(BAUD_RATE, SERIAL_8N1, SERIAL_FULL);
    Serial.println("");
    Serial.println("Swapping UART0 RX to inverted");
    Serial.flush();

    // Invert the RX serialport by setting a register value, this way the TX might continue normally allowing the serial monitor to read println's
    USC0(UART0) = USC0(UART0) | BIT(UCRXI);
    Serial.println("Serial port is ready to recieve.");

